tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "lotyp/homebrew-formulae" # needed for dockutil

brew "bat" # cat with syntax highlighting
brew "bottom" # top replacement, system dashboard
brew "coreutils" # better core /usr/bin
brew "duf"
brew "dust"
brew "duti" # set default OSX apps
brew "exa" # better ls
brew "fd" # find things easily
brew "ffmpeg"
brew "fnm" # NVM but in rust
brew "git"
brew "git-delta" # awesome git diffs
brew "hyperfine" # benchmark commands
brew "jq" # parse json from bash
brew "lotyp/formulae/dockutil"
brew "mackup"
brew "mas"
brew "monolith" # download websites
brew "neovim"
brew "ouch" # zip/unzip stuff easily
brew "ripgrep" # better faster grep
brew "serve"
brew "shellcheck"
brew "speedtest-cli"
brew "starship"
brew "tealdeer" # aint nobody got time for that
brew "youtube-dl"
brew "yarn"
brew "yt-dlp"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "choosy"
cask "docker"
cask "firefox", args: { 'no-quarantine': true }
# cask "firefox-developer-edition"
cask "font-meslo-lg-nerd-font"
cask "google-chrome" , args: { 'no-quarantine': true }
cask "insomnia"
cask "iterm2"
cask "kap"
cask "kitty"
cask "numi"
cask "qlmarkdown", args: { 'no-quarantine': true }
cask "quicklook-json"
cask "slack"
cask "spotify"
cask "stats", args: { 'no-quarantine': true }
cask "sublime-text"
cask "visual-studio-code" , args: { 'no-quarantine': true }
cask "vlc", args: { 'no-quarantine': true }
cask "whatsapp"

mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Simplenote", id: 692867256
mas "Ghostery – Privacy Ad Blocker", id: 1436953057
mas "MeetingBar", id: 1532419400
mas "New File Menu Lite", id: 1066302071
mas "NordVPN", id: 905953485
mas "GrandPerspective", id: 1111570163
mas "Telegram Lite", id: 946399090
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637

vscode "christian-kohler.npm-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mrmlnc.vscode-scss"
vscode "PKief.material-icon-theme"
vscode "syler.sass-indented"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "yoavbls.pretty-ts-errors"
