tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask-fonts"

brew "bat" # cat with syntax highlighting
brew "bottom" # top replacement, system dashboard
brew "coreutils" # better core /usr/bin
brew "duf"
brew "dust"
brew "exa" # better ls
brew "fd" # find things easily
brew "ffmpeg"
brew "fnm" # NVM but in rust
brew "git"
brew "git-delta" # awesome git diffs
brew "hyperfine" # benchmark commands
brew "jq" # parse json from bash
brew "mackup"
brew "monolith" # download websites
brew "neovim"
brew "ouch" # zip/unzip stuff easily
brew "ripgrep" # better faster grep
brew "shellcheck"
brew "starship"
brew "tealdeer" # aint nobody got time for that
brew "youtube-dl"
brew "yt-dlp"
brew "zsh"
brew "zsh-syntax-highlighting"

cask "firefox" , args: { 'no-quarantine': true }
cask "google-chrome" , args: { 'no-quarantine': true }
cask "iterm2"
cask "kap"
cask "kitty"
cask "numi"
cask "qlmarkdown", args: { 'no-quarantine': true }
cask "quicklook-json"
cask "stats" , args: { 'no-quarantine': true }
cask "sublime-text"
cask "visual-studio-code" , args: { 'no-quarantine': true }
cask "vlc" , args: { 'no-quarantine': true }

vscode "christian-kohler.npm-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mrmlnc.vscode-scss"
vscode "PKief.material-icon-theme"
vscode "syler.sass-indented"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
